# Pandas

Pandas is a package used for managing data.

Pandas main use is that it creates 2 new data types for storing data: series and dataframe.

Think of a pandas dataframe like an excel spreadsheet that is storing some data.  One column can have customer name, one column can have product sold name, another column can have price or quantity... Then the rows could be individual sales.

A dataframe is made up of several series.  Each column of a dataframe is a series.

We can name each column and row of a dataframe.

A pandas dataframe is very similar to a data.frame in R.

Similar to numpy arrays, a dataframe is a more robust data type for storing data than lists of lists. Dataframes are more flexible than numpy arrays.

A numpy array can create a matrix with all entries of the same data type.  In a dataframe each column can have its own datatype.  

That's not to say numpy arrays aren't useful.  It is often easiest to convert some subset of a dataframe to a numpy array and then use that to do some math.

Pandas also has SQL-like functions for merging, joining, and sorting dataframes.

In [3]:
import pandas as pd
import numpy as np  # numpy is not necessary for pandas, but we will use some np code in this example
# in general it's good practice to import all pacakages at the beginning

In [7]:
# first let's look at series - think of this as a single column of a spreadsheet
# each entry in a series corresponds to an individual row in the spreadsheet
# we can create a series by converting a list, or numpy array

mylist = [5.4,6.1,1.7,99.8]
myarray = np.array(mylist)
print(mylist)
print(myarray)

[5.4, 6.1, 1.7, 99.8]
[ 5.4  6.1  1.7 99.8]

In [8]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [9]:
# we access individual entries the same way as with lists and arrays
print(myseries1[2])

1.7

In [10]:
# we can add labels to the entries of a series

mylabels = ['first','second','third','fourth']
myseries3 = pd.Series(data=mylist,index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [11]:
# we need not be explicit about the entries of pd.Series
myseries4 = pd.Series(mylist,mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [12]:
# we can also access entries using the index labels
print(myseries4['second'])

6.1

In [13]:
# we can do math on series 
myseries5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [17]:
# we can combine series to create a dataframe using the concat function
df1 = pd.concat([myseries4,myseries5],axis=1,sort=False)
df1

           0    1
first    5.4  5.5
second   6.1  NaN
third    1.7  1.1
fourth  99.8  8.8
fifth    NaN  1.6

In [40]:
# we can create a new dataframe 
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  0.833157 -0.306783  1.642800  0.729213 -0.033148
1 -1.011271  0.359786  0.109998 -0.354789 -0.985852
2 -0.289029 -1.393372  0.137235 -1.858014  0.474897
3 -0.928781 -0.488720 -0.679384  0.545164 -0.150044
4 -0.913097  1.149618  0.557477  1.038778  0.006992

In [41]:
# lets give labels to rows and columns
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row    0.114805   -0.156721   0.460685   -0.624799   0.031447
second row  -0.269686    0.154850  -0.273914   -0.250234  -0.305364
third row   -1.156688    0.154720   0.252347   -1.154788   0.367549
fourth row   0.510674   -0.301236   1.482755   -0.001274   0.420024
fifth row   -0.259813   -0.214607  -0.241380   -0.014989  -1.649892

In [42]:
# we can access individual series in a data frame
print(df3['second col'])
print('')
df3[['third col','first col']]

first row    -0.156721
second row    0.154850
third row     0.154720
fourth row   -0.301236
fifth row    -0.214607
Name: second col, dtype: float64

            third col  first col
first row    0.460685   0.114805
second row  -0.273914  -0.269686
third row    0.252347  -1.156688
fourth row   1.482755   0.510674
fifth row   -0.241380  -0.259813

In [21]:
# we can access rows of a dataframe
df3.loc['fourth row']

first col    -0.120163
second col   -0.491637
third col    -0.331811
fourth col    0.657705
fifth col    -0.577323
Name: fourth row, dtype: float64

In [22]:
df3.iloc[2]

first col    -1.073762
second col    1.186480
third col    -0.958005
fourth col    0.563519
fifth col    -1.087462
Name: third row, dtype: float64

In [23]:
df3.loc[['fourth row','first row'],['second col','third col']]

            second col  third col
fourth row   -0.491637  -0.331811
first row    -0.267274  -0.014247

In [24]:
# we can use logical indexing for dataframes just like for numpy arrays
df3>0

            first col  second col  third col  fourth col  fifth col
first row        True       False      False        True       True
second row       True       False       True       False       True
third row       False        True      False        True      False
fourth row      False       False      False        True      False
fifth row        True       False      False       False      False

In [25]:
print(df3[df3>0])

            first col  second col  third col  fourth col  fifth col
first row    1.639712         NaN        NaN    0.470665   0.390266
second row   0.795189         NaN    1.56018         NaN   0.321614
third row         NaN     1.18648        NaN    0.563519        NaN
fourth row        NaN         NaN        NaN    0.657705        NaN
fifth row    2.320845         NaN        NaN         NaN        NaN

In [44]:
# we can add columns to a dataframe
df3['sixth col'] = np.random.randn(5,1)
df3

            first col  second col  third col  fourth col  fifth col  sixth col
first row    0.114805   -0.156721   0.460685   -0.624799   0.031447  -1.169138
second row  -0.269686    0.154850  -0.273914   -0.250234  -0.305364  -0.083714
third row   -1.156688    0.154720   0.252347   -1.154788   0.367549   0.589082
fourth row   0.510674   -0.301236   1.482755   -0.001274   0.420024   0.723523
fifth row   -0.259813   -0.214607  -0.241380   -0.014989  -1.649892   1.293339

In [39]:
# we can remove columns or rows from a dataframe
df3.drop('first col',axis=1,inplace=True)

KeyError: "['first col'] not found in axis"

In [46]:
df3

            first col  second col  third col  fourth col  fifth col  sixth col
first row    0.114805   -0.156721   0.460685   -0.624799   0.031447  -1.169138
second row  -0.269686    0.154850  -0.273914   -0.250234  -0.305364  -0.083714
third row   -1.156688    0.154720   0.252347   -1.154788   0.367549   0.589082
fourth row   0.510674   -0.301236   1.482755   -0.001274   0.420024   0.723523
fifth row   -0.259813   -0.214607  -0.241380   -0.014989  -1.649892   1.293339

In [47]:
df4 = df3.drop('first col',axis=1)
df4

            second col  third col  fourth col  fifth col  sixth col
first row    -0.156721   0.460685   -0.624799   0.031447  -1.169138
second row    0.154850  -0.273914   -0.250234  -0.305364  -0.083714
third row     0.154720   0.252347   -1.154788   0.367549   0.589082
fourth row   -0.301236   1.482755   -0.001274   0.420024   0.723523
fifth row    -0.214607  -0.241380   -0.014989  -1.649892   1.293339

In [48]:
df5 = df3.drop('second row',axis=0)
df5

            first col  second col  third col  fourth col  fifth col  sixth col
first row    0.114805   -0.156721   0.460685   -0.624799   0.031447  -1.169138
third row   -1.156688    0.154720   0.252347   -1.154788   0.367549   0.589082
fourth row   0.510674   -0.301236   1.482755   -0.001274   0.420024   0.723523
fifth row   -0.259813   -0.214607  -0.241380   -0.014989  -1.649892   1.293339

In [49]:
# we can remove a dataframe's index labels
df5.reset_index()

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,0.114805,-0.156721,0.460685,-0.624799,0.031447,-1.169138
1,third row,-1.156688,0.154720,0.252347,-1.154788,0.367549,0.589082
2,fourth row,0.510674,-0.301236,1.482755,-0.001274,0.420024,0.723523
3,fifth row,-0.259813,-0.214607,-0.241380,-0.014989,-1.649892,1.293339

In [56]:
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
new name,,,,,,,
This,first row,0.114805,-0.156721,0.460685,-0.624799,0.031447,-1.169138
is,third row,-1.156688,0.154720,0.252347,-1.154788,0.367549,0.589082
the,fourth row,0.510674,-0.301236,1.482755,-0.001274,0.420024,0.723523
row,fifth row,-0.259813,-0.214607,-0.241380,-0.014989,-1.649892,1.293339

In [51]:
df5.reset_index(inplace=True)
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,0.114805,-0.156721,0.460685,-0.624799,0.031447,-1.169138
1,third row,-1.156688,0.154720,0.252347,-1.154788,0.367549,0.589082
2,fourth row,0.510674,-0.301236,1.482755,-0.001274,0.420024,0.723523
3,fifth row,-0.259813,-0.214607,-0.241380,-0.014989,-1.649892,1.293339

In [53]:
# we can assign new names to the index
df5['new name'] = ['This','is','the','row']
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col,new name
0,first row,0.114805,-0.156721,0.460685,-0.624799,0.031447,-1.169138,This
1,third row,-1.156688,0.154720,0.252347,-1.154788,0.367549,0.589082,is
2,fourth row,0.510674,-0.301236,1.482755,-0.001274,0.420024,0.723523,the
3,fifth row,-0.259813,-0.214607,-0.241380,-0.014989,-1.649892,1.293339,row

In [55]:
df5.set_index('new name',inplace=True)
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
new name,,,,,,,
This,first row,0.114805,-0.156721,0.460685,-0.624799,0.031447,-1.169138
is,third row,-1.156688,0.154720,0.252347,-1.154788,0.367549,0.589082
the,fourth row,0.510674,-0.301236,1.482755,-0.001274,0.420024,0.723523
row,fifth row,-0.259813,-0.214607,-0.241380,-0.014989,-1.649892,1.293339

# Combining data frames

The ways dataframes are combined in pandas is similar to SQL

We will examine 3 methods for combining dataframes

1. concat
2. join
3. merge

In [58]:


df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [61]:
pd.concat([df7,df8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [62]:
pd.concat([df7,df8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [ ]:
pd.concat([df7,df8],axis=1,sort=False)

# Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [ ]:
pd.merge(df7,df8,how='outer',on='customer') # outer merge is union of on

In [ ]:
pd.merge(df7,df8,how='inner',on='customer') # inner merge is intersection of on

In [ ]:
pd.merge(df7,df8,how='right',on='customer') # left merge is just first on, but all columns ... right is second

In [ ]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [ ]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df9.join(df10,how='right') # outer, inner, left, and right work the same as merge

In [ ]:
# let's now go over a few more basic functialities of pandas

df8['color'].unique()

In [ ]:
df8['color'].value_counts()

In [ ]:
df9.mean()

In [ ]:
df8.columns

In [ ]:
df8

In [ ]:
new_df = df8[(df8['customer']!='105') & (df8['color']!='green')]
new_df

In [ ]:
print(df8['sales'].sum())
print(df8['distance'].min())

In [ ]:
def profit(s):
    return s*0.5 # 50% markup...

In [ ]:
df8['sales'].apply(profit)

In [ ]:
df8['color'].apply(len)

In [ ]:
df11 = df8[['distance','sales']]
df11.applymap(profit)

In [ ]:
def col_sum(co):
    return sum(co)
df11.apply(col_sum)

In [ ]:
df11.applymap(col_sum)

In [ ]:
del df8['color']
df8

In [ ]:
df8.index

In [ ]:
df8.sort_values(by='distance',inplace=True)
df8

In [ ]:
df8

In [ ]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

In [ ]:
grouped_data = df6.groupby('customer')
print(grouped_data)

In [ ]:
grouped_data.std()

In [ ]:
df8

In [ ]:
# similar to numpy arrays, we can also save and load dataframes to csv files, and also Excel files

df8.to_csv('df8.csv',index=True)

In [ ]:
new_df8 = pd.read_csv('df8.csv',index_col=0)
new_df8

In [ ]:
df8.to_excel('df8.xlsx',index=False,sheet_name='first sheet')
newer_df8 = pd.read_excel('df8.xlsx',sheet_name='first sheet',index_col=1)
newer_df8